fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ВКМ_Начало
	// Вызываем управление видимостью при открытии, чтобы сразу скрыть/показать нужное
	ВКМ_УправлениеВидимостьюЭлементов();
	// ВКМ_Конец
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)
	
	// ВКМ_Начало
	// При изменении вида договора пользователем сразу меняем видимость
	ВКМ_УправлениеВидимостьюЭлементов();
	// ВКМ_Конец
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ВКМ_Начало
&НаСервере
Процедура ВКМ_УправлениеВидимостьюЭлементов()
	
	// Определяем, выбран ли наш новый вид договора
	ЭтоАбонентский = (Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	// Устанавливаем видимость. 
	// Предполагается, что элементы уже вынесены на форму в редакторе.
	
	// Используем Попытка/Исключение на случай, если ты забыл вынести какой-то реквизит на форму,
	// чтобы 1С не выдала ошибку пользователю.
	Попытка
		Элементы.ВКМ_ДатаНачала.Видимость              = ЭтоАбонентский;
		Элементы.ВКМ_ДатаОкончания.Видимость           = ЭтоАбонентский;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость   = ЭтоАбонентский;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость     = ЭтоАбонентский;
	Исключение
		// В реальной разработке здесь можно записать лог, но для диплома можно оставить пустым
	КонецПопытки;
	
КонецПроцедуры
// ВКМ_Конец

#КонецОбласти
